alexeyk13/rexos/userspace/lpc/lpc18xx_bits.h
/*
    RExOS - embedded RTOS
    Copyright (c) 2011-2016, Alexey Kramarenko
    All rights reserved.
*/

#ifndef LPC18UXX_BITS_H
#define LPC18UXX_BITS_H

/*
 *      Only values, not provided by vendor library
 */

/******************************************************************************/
/*                                                                            */
/*                 CREG (Configuration registers)                             */
/*                                                                            */
/******************************************************************************/

/*********  Bit definition for FLASHCFG* registers  ***************************/
#define CREG_FLASHCFG_MAGIC_Msk                  (0x3a << 0)
#define CREG_FLASHCFG_FLASHTIM_Pos               12
#define CREG_FLASHCFG_FLASHTIM_Msk               (0xf << 12)
#define CREG_FLASHCFG_POW_Msk                    (1 << 31)

/******************************************************************************/
/*                                                                            */
/*                  CGU (Clock Generation Unit)                               */
/*                                                                            */
/******************************************************************************/

#define CGU_CLK_LSE                             (0 << 24)
#define CGU_CLK_IRC                             (1 << 24)
#define CGU_CLK_ENET_RX                         (2 << 24)
#define CGU_CLK_ENET_TX                         (3 << 24)
#define CGU_CLK_GP_CLKIN                        (4 << 24)
#define CGU_CLK_HSE                             (6 << 24)
#define CGU_CLK_PLL0AUDIO                       (8 << 24)
#define CGU_CLK_PLL1                            (9 << 24)
#define CGU_CLK_IDIVA                           (0xc << 24)
#define CGU_CLK_IDIVB                           (0xd << 24)
#define CGU_CLK_IDIVC                           (0xe << 24)
#define CGU_CLK_IDIVD                           (0xf << 24)
#define CGU_CLK_IDIVE                           (0x10 << 24)

/******************************************************************************/
/*                                                                            */
/*                   SCU (System Control Unit)                                */
/*                                                                            */
/******************************************************************************/

/********  Bit definition for SCU_SFS* registers  ***************************/
#define SCU_SFS_EPD                             (1 << 3)                /* Enable pull-down resistor at pad.
                                                                           0 Disable pull-down.
                                                                           1 Enable pull-down. Enable both pull-down resistor and pull-up resistor
                                                                           for repeater mode */
#define SCU_SFS_EPUN                            (1 << 4)                /* Disable pull-up resistor at pad. By default, the pull-up resistor is enabled at reset.
                                                                           0 Enable pull-up. Enable both pull-down resistor and pull-up resistor for repeater mode.
                                                                           1 Disable pull-up */
#define SCU_SFS_EHS                             (1 << 5)                /* Select Slew rate.
                                                                           0 Slow (low noise with medium speed)
                                                                           1 Fast (medium noise with fast speed)*/
#define SCU_SFS_EZI                             (1 << 6)                /* Input buffer enable. The input buffer is disabled by default at reset and must be
                                                                           enabled for receiving.
                                                                           0 Disable input buffer
                                                                           1 Enable input buffer */
#define SCU_SFS_ZIF                             (1 << 7)                /* Input glitch filter. Disable the input glitch filter for clocking signals higher than 30 MHz.
                                                                           0 Enable input glitch filter
                                                                           1 Disable input glitch filter */
                                                                        /* Select drive strength. */
#define SCU_SFS_EHD_NORMAL                      (0 << 8)                /* 0x0 Normal-drive: 4 mA drive strength */
#define SCU_SFS_EHD_MEDIUM                      (1 << 8)                /* 0x1 Medium-drive: 8 mA drive strength */
#define SCU_SFS_EHD_HIGH                        (2 << 8)                /* 0x2 High-drive: 14 mA drive strength */
#define SCU_SFS_EHD_ULTRA_HIGH                  (3 << 8)                /* 0x3 Ultra high-drive: 20 mA drive strength */

/******  Bit definition for SCU_SFSUSB registers  ***************************/
#define SCU_SFSUSB_AIM_Msk                      (1 << 0)                /* Differential data input AIP/AIM.
                                                                           0 Going LOW with full speed edge rate
                                                                           1 Going HIGH with full speed edge rate */
#define SCU_SFSUSB_ESEA_Msk                     (1 << 1)                /* Control signal for differential input or single input.
                                                                           0 Reserved. Do not use.
                                                                           1 Single input. Enables USB1. Use with the on-chip full-speed PHY */
#define SCU_SFSUSB_EPD_Msk                      (1 << 2)                /* Enable pull-down connect.
                                                                           0 Pull-down disconnected
                                                                           1 Pull-down connected */
#define SCU_SFSUSB_EPWR_Msk                     (1 << 4)                /* Power mode.
                                                                           0 Power saving mode (Suspend mode)
                                                                           1 Normal mode */
#define SCU_SFSUSB_VBUS_Msk                     (1 << 5)                /* Enable the vbus_valid signal. This signal is monitored by the USB1 block. Use this bit
                                                                           for software de-bouncing of the VBUS sense signal or to indicate the VBUS state to the
                                                                           USB1 controller when the VBUS signal is present but the USB1_VBUS function is not
                                                                           connected in the SFSP2_5 register.
                                                                           Remark: The setting of this bit has no effect if the USB1_VBUS function of pin
                                                                           P2_5 is enabled through the SFSP2_5 register.
                                                                           0 VBUS signal LOW or inactive
                                                                           1 VBUS signal HIGH or active */

/******  Bit definition for SCU_SFSI2C0 registers  **************************/
#define SCU_SFSI2C0_SCL_EFP                     (1 << 0)                /* Select input glitch filter time constant for the SCL pin.
                                                                           0 50 ns glitch filter
                                                                           1 3 ns glitch filter */
#define SCU_SFSI2C0_SCL_EHD                     (1 << 2)                /* Select I2C mode for the SCL pin.
                                                                           0 Standard/Fast mode transmit
                                                                           1 Fast-mode Plus transmit */
#define SCU_SFSI2C0_SCL_EZI                     (1 << 3)                /* Enable the input receiver for the SCL pin. Always write a 1 to this bit when using
                                                                           the I2C0.
                                                                           0 Disabled
                                                                           1 Enabled */
#define SCU_SFSI2C0_SCL_ZIF                     (1 << 7)                /* Enable or disable input glitch filter for the  SCL pin. The filter time constant is
                                                                           determined by bit SCL_EFP.
                                                                           0 Enable input filter
                                                                           1 Disable input filter */
#define SCU_SFSI2C0_SDA_EFP                     (1 << 8)                /* Select input glitch filter time constant for the SDA pin.
                                                                           0 50 ns glitch filter
                                                                           1 3 ns glitch filter */
#define SCU_SFSI2C0_SDA_EHD                     (1 << 10)               /* Select I2C mode for the SDA pin.
                                                                           0 Standard/Fast mode transmit
                                                                           1 Fast-mode Plus transmit */
#define SCU_SFSI2C0_SDA_EZI                     (1 << 11)               /* Enable the input receiver for the SDA pin. Always write a 1 to this bit when using
                                                                           the I2C0.
                                                                           0 Disabled
                                                                           1 Enabled */
#define SCU_SFSI2C0_SDA_ZIF                     (1 << 15)               /* Enable or disable input glitch filter for the SDA pin. The filter time constant is
                                                                           determined by bit SDA_EFP.
                                                                           0 Enable input filter
                                                                           1 Disable input filter */

