alexeyk13/rexos/userspace/lpc/lpc18xx_bits.h
//P0_0
#define P0_0_GPIO0_0                            (0 << 0)
#define P0_0_SSP1_MISO                          (1 << 0)
#define P0_0_ENET_RXD1                          (2 << 0)
#define P0_0_I2S0_TX_WS                         (6 << 0)
#define P0_0_I2S1_TX_WS                         (7 << 0)

//P0_1
#define P0_1_GPIO0_1                            (0 << 0)
#define P0_1_SSP1_MOSI                          (1 << 0)
#define P0_1_ENET_COL                           (2 << 0)
#define P0_1_ENET_TX_EN                         (6 << 0)
#define P0_1_I2S1_TX_SDA                        (7 << 0)

//P1_0
#define P1_0_GPIO0_4                            (0 << 0)
#define P1_0_CTIN_3                             (1 << 0)
#define P1_0_EMC_A5                             (2 << 0)
#define P1_0_SSP0_SSEL                          (5 << 0)
#define P1_0_EMC_D12                            (7 << 0)

//P1_1
#define P1_1_GPIO0_8                            (0 << 0)
#define P1_1_CTOUT_7                            (1 << 0)
#define P1_1_EMC_A6                             (2 << 0)
#define P1_1_SSP0_MISO                          (5 << 0)
#define P1_1_EMC_D13                            (7 << 0)

//P1_2
#define P1_2_GPIO0_9                            (0 << 0)
#define P1_2_CTOUT_6                            (1 << 0)
#define P1_2_EMC_A7                             (2 << 0)
#define P1_2_SSP0_MOSI                          (5 << 0)
#define P1_2_EMC_D14                            (7 << 0)

//P1_3
#define P1_3_GPIO0_10                           (0 << 0)
#define P1_3_CTOUT_8                            (1 << 0)
#define P1_3_EMC_OE                             (3 << 0)
#define P1_3_USB0_IND1                          (4 << 0)
#define P1_3_SSP1_MISO                          (5 << 0)
#define P1_3_SD_RST                             (7 << 0)

//P1_4
#define P1_4_GPIO0_11                           (0 << 0)
#define P1_4_CTOUT_9                            (1 << 0)
#define P1_4_EMC_BLS0                           (3 << 0)
#define P1_4_USB0_IND0                          (4 << 0)
#define P1_4_SSP1_MOSI                          (5 << 0)
#define P1_4_EMC_D15                            (6 << 0)
#define P1_4_SD_VOLT1                           (7 << 0)

//P1_5
#define P1_5_GPIO1_8                            (0 << 0)
#define P1_5_CTOUT_10                           (1 << 0)
#define P1_5_EMC_CS0                            (3 << 0)
#define P1_5_USB0_PWR_FAULT                     (4 << 0)
#define P1_5_SSP1_SSEL                          (5 << 0)
#define P1_5_SD_POW                             (7 << 0)

//P1_6
#define P1_6_GPIO1_9                            (0 << 0)
#define P1_6_CTIN_5                             (1 << 0)
#define P1_6_EMC_WE                             (3 << 0)
#define P1_6_EMC_BLS0                           (5 << 0)
#define P1_6_SD_CMD                             (7 << 0)

//P1_7
#define P1_7_GPIO1_0                            (0 << 0)
#define P1_7_U1_DSR                             (1 << 0)
#define P1_7_CTOUT_13                           (2 << 0)
#define P1_7_EMC_D0                             (3 << 0)
#define P1_7_USB0_PWR_EN                        (4 << 0)

//P1_8
#define P1_8_GPIO1_1                            (0 << 0)
#define P1_8_U1_DTR                             (1 << 0)
#define P1_8_CTOUT_12                           (2 << 0)
#define P1_8_EMC_D1                             (3 << 0)
#define P1_8_SD_VOLT0                           (7 << 0)

//P1_9
#define P1_9_GPIO1_2                            (0 << 0)
#define P1_9_U1_RTS                             (1 << 0)
#define P1_9_CTOUT_11                           (2 << 0)
#define P1_9_EMC_D2                             (3 << 0)
#define P1_9_SD_DAT0                            (7 << 0)

//P1_10
#define P1_10_GPIO1_3                           (0 << 0)
#define P1_10_U1_RI                             (1 << 0)
#define P1_10_CTOUT_14                          (2 << 0)
#define P1_10_EMC_D3                            (3 << 0)
#define P1_10_SD_DAT1                           (7 << 0)

//P1_11
#define P1_11_GPIO1_4                           (0 << 0)
#define P1_11_U1_CTS                            (1 << 0)
#define P1_11_CTOUT_15                          (2 << 0)
#define P1_11_EMC_D4                            (3 << 0)
#define P1_11_SD_DAT2                           (7 << 0)

//P1_12
#define P1_12_GPIO1_5                           (0 << 0)
#define P1_12_U1_DCD                            (1 << 0)
#define P1_12_EMC_D5                            (3 << 0)
#define P1_12_T0_CAP1                           (4 << 0)
#define P1_12_SD_DAT3                           (7 << 0)

//P1_13
#define P1_13_GPIO1_6                           (0 << 0)
#define P1_13_U1_TXD                            (1 << 0)
#define P1_13_EMC_D6                            (3 << 0)
#define P1_13_T0_CAP0                           (4 << 0)
#define P1_13_SD_CD                             (7 << 0)

//P1_14
#define P1_14_GPIO1_7                           (0 << 0)
#define P1_14_U1_RXD                            (1 << 0)
#define P1_14_EMC_D7                            (3 << 0)
#define P1_14_T0_MAT2                           (4 << 0)

//P1_15
#define P1_15_GPIO0_2                           (0 << 0)
#define P1_15_U2_TXD                            (1 << 0)
#define P1_15_ENET_RXD0                         (3 << 0)
#define P1_15_T0_MAT1                           (4 << 0)
#define P1_15_EMC_D8                            (6 << 0)

//P1_16
#define P1_16_GPIO0_3                           (0 << 0)
#define P1_16_U2_RXD                            (1 << 0)
#define P1_16_ENET_CRS                          (3 << 0)
#define P1_16_T0_MAT0                           (4 << 0)
#define P1_16_EMC_D9                            (6 << 0)
#define P1_16_ENET_RX_DV                        (7 << 0)

//P1_17
#define P1_17_GPIO0_12                          (0 << 0)
#define P1_17_U2_UCLK                           (1 << 0)
#define P1_17_ENET_MDIO                         (3 << 0)
#define P1_17_T0_CAP3                           (4 << 0)
#define P1_17_CAN1_TD                           (5 << 0)

//P1_18
#define P1_18_GPIO0_13                          (0 << 0)
#define P1_18_U2_DIR                            (1 << 0)
#define P1_18_ENET_TXD0                         (3 << 0)
#define P1_18_T0_MAT3                           (4 << 0)
#define P1_18_CAN1_RD                           (5 << 0)
#define P1_18_EMC_D10                           (7 << 0)

