alexeyk13/rexos/userspace/lpc/lpc18xx_bits.h
//P1_19
#define P1_19_ENET_TX_CLK                       (0 << 0)
#define P1_19_SSP1_SCK                          (1 << 0)
#define P1_19_CLKOUT                            (4 << 0)
#define P1_19_I2S0_RX_MCLK                      (6 << 0)
#define P1_19_I2S1_TX_SCK                       (7 << 0)

//P1_20
#define P1_20_GPIO0_15                          (0 << 0)
#define P1_20_SSP1_SSEL                         (1 << 0)
#define P1_20_ENET_TXD1                         (3 << 0)
#define P1_20_T0_CAP2                           (4 << 0)
#define P1_20_EMC_D11                           (7 << 0)

//P2_0
#define P2_0_U0_TXD                             (1 << 0)
#define P2_0_EMC_A13                            (2 << 0)
#define P2_0_USB0_PWR_EN                        (3 << 0)
#define P2_0_GPIO5_0                            (4 << 0)
#define P2_0_T3_CAP0                            (6 << 0)
#define P2_0_ENET_MDC                           (7 << 0)

//P2_1
#define P2_1_U0_RXD                             (1 << 0)
#define P2_1_EMC_A12                            (2 << 0)
#define P2_1_USB0_PWR_FAULT                     (3 << 0)
#define P2_1_GPIO5_1                            (4 << 0)
#define P2_1_T3_CAP1                            (6 << 0)

//P2_2
#define P2_2_U0_UCLK                            (1 << 0)
#define P2_2_EMC_A11                            (2 << 0)
#define P2_2_USB0_IND1                          (3 << 0)
#define P2_2_GPIO5_2                            (4 << 0)
#define P2_2_CTIN_6                             (5 << 0)
#define P2_2_T3_CAP2                            (6 << 0)
#define P2_2_EMC_CS1                            (7 << 0)

//P2_3
#define P2_3_I2C1_SDA                           (1 << 0)
#define P2_3_U3_TXD                             (2 << 0)
#define P2_3_CTIN_1                             (3 << 0)
#define P2_3_GPIO5_3                            (4 << 0)
#define P2_3_T3_MAT0                            (6 << 0)
#define P2_3_USB0_PWR_EN                        (7 << 0)

//P2_4
#define P2_4_I2C1_SCL                           (1 << 0)
#define P2_4_U3_RXD                             (2 << 0)
#define P2_4_CTIN_0                             (3 << 0)
#define P2_4_GPIO5_4                            (4 << 0)
#define P2_4_T3_MAT1                            (6 << 0)
#define P2_4_USB0_PWR_FAULT                     (7 << 0)

//P2_5
#define P2_5_CTIN_2                             (1 << 0)
#define P2_5_USB1_VBUS                          (2 << 0)
#define P2_5_ADCTRIG1                           (3 << 0)
#define P2_5_GPIO5_5                            (4 << 0)
#define P2_5_T3_MAT2                            (6 << 0)
#define P2_5_USB0_IND0                          (7 << 0)

//P2_6
#define P2_6_U0_DIR                             (1 << 0)
#define P2_6_EMC_A10                            (2 << 0)
#define P2_6_USB0_IND0                          (3 << 0)
#define P2_6_GPIO5_6                            (4 << 0)
#define P2_6_CTIN_7                             (5 << 0)
#define P2_6_T3_CAP3                            (6 << 0)
#define P2_6_EMC_BLS1                           (7 << 0)

//P2_7
#define P2_7_GPIO0_7                            (0 << 0)
#define P2_7_CTOUT_1                            (1 << 0)
#define P2_7_U3_UCLK                            (2 << 0)
#define P2_7_EMC_A9                             (3 << 0)
#define P2_7_T3_MAT3                            (6 << 0)

//P2_8
#define P2_8_CTOUT_0                            (1 << 0)
#define P2_8_U3_DIR                             (2 << 0)
#define P2_8_EMC_A8                             (3 << 0)
#define P2_8_GPIO5_7                            (4 << 0)

//P2_9
#define P2_9_GPIO1_10                           (0 << 0)
#define P2_9_CTOUT_3                            (1 << 0)
#define P2_9_U3_BAUD                            (2 << 0)
#define P2_9_EMC_A0                             (3 << 0)

//P2_10
#define P2_10_GPIO0_14                          (0 << 0)
#define P2_10_CTOUT_2                           (1 << 0)
#define P2_10_U2_TXD                            (2 << 0)
#define P2_10_EMC_A1                            (3 << 0)

//P2_11
#define P2_11_GPIO1_11                          (0 << 0)
#define P2_11_CTOUT_5                           (1 << 0)
#define P2_11_U2_RXD                            (2 << 0)
#define P2_11_EMC_A2                            (3 << 0)

//P2_12
#define P2_12_GPIO1_12                          (0 << 0)
#define P2_12_CTOUT_4                           (1 << 0)
#define P2_12_EMC_A3                            (3 << 0)
#define P2_12_U2_UCLK                           (7 << 0)

//P2_13
#define P2_13_GPIO1_13                          (0 << 0)
#define P2_13_CTIN_4                            (1 << 0)
#define P2_13_EMC_A4                            (3 << 0)
#define P2_13_U2_DIR                            (7 << 0)

//P3_0
#define P3_0_I2S0_RX_SCK                        (0 << 0)
#define P3_0_I2S0_RX_MCLK                       (1 << 0)
#define P3_0_I2S0_TX_SCK                        (2 << 0)
#define P3_0_I2S0_TX_MCLK                       (3 << 0)
#define P3_0_SSP0_SCK                           (4 << 0)

//P3_1
#define P3_1_I2S0_TX_WS                         (0 << 0)
#define P3_1_I2S0_RX_WS                         (1 << 0)
#define P3_1_CAN0_RD                            (2 << 0)
#define P3_1_USB1_IND1                          (3 << 0)
#define P3_1_GPIO5_8                            (4 << 0)
#define P3_1_LCD_VD15                           (6 << 0)

//P3_2
#define P3_2_I2S0_TX_SDA                        (0 << 0)
#define P3_2_I2S0_RX_SDA                        (1 << 0)
#define P3_2_CAN0_TD                            (2 << 0)
#define P3_2_USB1_IND0                          (3 << 0)
#define P3_2_GPIO5_9                            (4 << 0)
#define P3_2_LCD_VD14                           (6 << 0)

//P3_3
#define P3_3_SSP0_SCK                           (2 << 0)
#define P3_3_SPIFI_SCK                          (3 << 0)
#define P3_3_CGU_OUT1                           (4 << 0)
#define P3_3_I2S0_TX_MCLK                       (6 << 0)
#define P3_3_I2S1_TX_SCK                        (7 << 0)

