alexeyk13/rexos/userspace/lpc/lpc18xx_bits.h
//P3_4
#define P3_4_GPIO1_14                           (0 << 0)
#define P3_4_SPIFI_SIO3                         (3 << 0)
#define P3_4_U1_TXD                             (4 << 0)
#define P3_4_I2S0_TX_WS                         (5 << 0)
#define P3_4_I2S1_RX_SDA                        (6 << 0)
#define P3_4_LCD_VD13                           (7 << 0)

//P3_5
#define P3_5_GPIO1_15                           (0 << 0)
#define P3_5_SPIFI_SIO2                         (3 << 0)
#define P3_5_U1_RXD                             (4 << 0)
#define P3_5_I2S0_TX_SDA                        (5 << 0)
#define P3_5_I2S1_RX_WS                         (6 << 0)
#define P3_5_LCD_VD12                           (7 << 0)

//P3_6
#define P3_6_GPIO0_6                            (0 << 0)
#define P3_6_SSP0_SSEL                          (2 << 0)
#define P3_6_SPIFI_MISO                         (3 << 0)
#define P3_6_SSP0_MISO                          (5 << 0)

//P3_7
#define P3_7_SSP0_MISO                          (2 << 0)
#define P3_7_SPIFI_MOSI                         (3 << 0)
#define P3_7_GPIO5_10                           (4 << 0)
#define P3_7_SSP0_MOSI                          (5 << 0)

//P3_8
#define P3_8_SSP0_MOSI                          (2 << 0)
#define P3_8_SPIFI_CS                           (3 << 0)
#define P3_8_GPIO5_11                           (4 << 0)
#define P3_8_SSP0_SSEL                          (5 << 0)

//P4_0
#define P4_0_GPIO2_0                            (0 << 0)
#define P4_0_MCOA0                              (1 << 0)
#define P4_0_NMI                                (2 << 0)
#define P4_0_LCD_VD13                           (5 << 0)
#define P4_0_U3_UCLK                            (6 << 0)

//P4_1
#define P4_1_GPIO2_1                            (0 << 0)
#define P4_1_CTOUT_1                            (1 << 0)
#define P4_1_LCD_VD0                            (2 << 0)
#define P4_1_LCD_VD19                           (5 << 0)
#define P4_1_U3_TXD                             (6 << 0)
#define P4_1_ENET_COL                           (7 << 0)

//P4_2
#define P4_2_GPIO2_2                            (0 << 0)
#define P4_2_CTOUT_0                            (1 << 0)
#define P4_2_LCD_VD3                            (2 << 0)
#define P4_2_LCD_VD12                           (5 << 0)
#define P4_2_U3_RXD                             (6 << 0)

//P4_3
#define P4_3_GPIO2_3                            (0 << 0)
#define P4_3_CTOUT_3                            (1 << 0)
#define P4_3_LCD_VD2                            (2 << 0)
#define P4_3_LCD_VD21                           (5 << 0)
#define P4_3_U3_BAUD                            (6 << 0)

//P4_4
#define P4_4_GPIO2_4                            (0 << 0)
#define P4_4_CTOUT_2                            (1 << 0)
#define P4_4_LCD_VD1                            (2 << 0)
#define P4_4_LCD_VD20                           (5 << 0)
#define P4_4_U3_DIR                             (6 << 0)

//P4_5
#define P4_5_GPIO2_5                            (0 << 0)
#define P4_5_CTOUT_5                            (1 << 0)
#define P4_5_LCD_FP                             (2 << 0)

//P4_6
#define P4_6_GPIO2_6                            (0 << 0)
#define P4_6_CTOUT_4                            (1 << 0)
#define P4_6_LCD_ENAB_LCDM                      (2 << 0)

//P4_7
#define P4_7_LCD_DCLK                           (0 << 0)
#define P4_7_GP_CLKIN                           (1 << 0)
#define P4_7_I2S1_TX_SCK                        (6 << 0)
#define P4_7_I2S0_TX_SCK                        (7 << 0)

//P4_8
#define P4_8_CTIN_5                             (1 << 0)
#define P4_8_LCD_VD9                            (2 << 0)
#define P4_8_GPIO5_12                           (4 << 0)
#define P4_8_LCD_VD22                           (5 << 0)
#define P4_8_CAN1_TD                            (6 << 0)

//P4_9
#define P4_9_CTIN_6                             (1 << 0)
#define P4_9_LCD_VD11                           (2 << 0)
#define P4_9_GPIO5_13                           (4 << 0)
#define P4_9_LCD_VD15                           (5 << 0)
#define P4_9_CAN1_RD                            (6 << 0)

//P4_10
#define P4_10_CTIN_2                            (1 << 0)
#define P4_10_LCD_VD10                          (2 << 0)
#define P4_10_GPIO5_14                          (4 << 0)
#define P4_10_LCD_VD14                          (5 << 0)

//P5_0
#define P5_0_GPIO2_9                            (0 << 0)
#define P5_0_MCOB2                              (1 << 0)
#define P5_0_EMC_D12                            (2 << 0)
#define P5_0_U1_DSR                             (4 << 0)
#define P5_0_T1_CAP0                            (5 << 0)

//P5_1
#define P5_1_GPIO2_10                           (0 << 0)
#define P5_1_MCI2                               (1 << 0)
#define P5_1_EMC_D13                            (2 << 0)
#define P5_1_U1_DTR                             (4 << 0)
#define P5_1_T1_CAP1                            (5 << 0)

//P5_2
#define P5_2_GPIO2_11                           (0 << 0)
#define P5_2_MCI1                               (1 << 0)
#define P5_2_EMC_D14                            (2 << 0)
#define P5_2_U1_RTS                             (4 << 0)
#define P5_2_T1_CAP2                            (5 << 0)

//P5_3
#define P5_3_GPIO2_12                           (0 << 0)
#define P5_3_MCI0                               (1 << 0)
#define P5_3_EMC_D15                            (2 << 0)
#define P5_3_U1_RI                              (4 << 0)
#define P5_3_T1_CAP3                            (5 << 0)

//P5_4
#define P5_4_GPIO2_13                           (0 << 0)
#define P5_4_MCOB0                              (1 << 0)
#define P5_4_EMC_D8                             (2 << 0)
#define P5_4_U1_CTS                             (4 << 0)
#define P5_4_T1_MAT0                            (5 << 0)

//P5_5
#define P5_5_GPIO2_14                           (0 << 0)
#define P5_5_MCOA1                              (1 << 0)
#define P5_5_EMC_D9                             (2 << 0)
#define P5_5_U1_DCD                             (4 << 0)
#define P5_5_T1_MAT1                            (5 << 0)

//P5_6
#define P5_6_GPIO2_15                           (0 << 0)
#define P5_6_MCOB1                              (1 << 0)
#define P5_6_EMC_D10                            (2 << 0)
#define P5_6_U1_TXD                             (4 << 0)
#define P5_6_T1_MAT2                            (5 << 0)

