alexeyk13/rexos/userspace/lpc/lpc18xx_bits.h
//P5_7
#define P5_7_GPIO2_7                            (0 << 0)
#define P5_7_MCOA2                              (1 << 0)
#define P5_7_EMC_D11                            (2 << 0)
#define P5_7_U1_RXD                             (4 << 0)
#define P5_7_T1_MAT3                            (5 << 0)

//P6_0
#define P6_0_I2S0_RX_MCLK                       (1 << 0)
#define P6_0_I2S0_RX_SCK                        (4 << 0)

//P6_1
#define P6_1_GPIO3_0                            (0 << 0)
#define P6_1_EMC_DYCS1                          (1 << 0)
#define P6_1_U0_UCLK                            (2 << 0)
#define P6_1_I2S0_RX_WS                         (3 << 0)
#define P6_1_T2_CAP0                            (5 << 0)

//P6_2
#define P6_2_GPIO3_1                            (0 << 0)
#define P6_2_EMC_CKEOUT1                        (1 << 0)
#define P6_2_U0_DIR                             (2 << 0)
#define P6_2_I2S0_RX_SDA                        (3 << 0)
#define P6_2_T2_CAP1                            (5 << 0)

//P6_3
#define P6_3_GPIO3_2                            (0 << 0)
#define P6_3_USB0_PWR_EN                        (1 << 0)
#define P6_3_EMC_CS1                            (3 << 0)
#define P6_3_T2_CAP2                            (5 << 0)

//P6_4
#define P6_4_GPIO3_3                            (0 << 0)
#define P6_4_CTIN_6                             (1 << 0)
#define P6_4_U0_TXD                             (2 << 0)
#define P6_4_EMC_CAS                            (3 << 0)

//P6_5
#define P6_5_GPIO3_4                            (0 << 0)
#define P6_5_CTOUT_6                            (1 << 0)
#define P6_5_U0_RXD                             (2 << 0)
#define P6_5_EMC_RAS                            (3 << 0)

//P6_6
#define P6_6_GPIO0_5                            (0 << 0)
#define P6_6_EMC_BLS1                           (1 << 0)
#define P6_6_USB0_PWR_FAULT                     (3 << 0)
#define P6_6_T2_CAP3                            (5 << 0)

//P6_7
#define P6_7_EMC_A15                            (1 << 0)
#define P6_7_USB0_IND1                          (3 << 0)
#define P6_7_GPIO5_15                           (4 << 0)
#define P6_7_T2_MAT0                            (5 << 0)

//P6_8
#define P6_8_EMC_A14                            (1 << 0)
#define P6_8_USB0_IND0                          (3 << 0)
#define P6_8_GPIO5_16                           (4 << 0)
#define P6_8_T2_MAT1                            (5 << 0)

//P6_9
#define P6_9_GPIO3_5                            (0 << 0)
#define P6_9_EMC_DYCS0                          (3 << 0)
#define P6_9_T2_MAT2                            (5 << 0)

//P6_10
#define P6_10_GPIO3_6                           (0 << 0)
#define P6_10_MCABORT                           (1 << 0)
#define P6_10_EMC_DQMOUT1                       (3 << 0)

//P6_11
#define P6_11_GPIO3_7                           (0 << 0)
#define P6_11_EMC_CKEOUT0                       (3 << 0)
#define P6_11_T2_MAT3                           (5 << 0)

//P6_12
#define P6_12_GPIO2_8                           (0 << 0)
#define P6_12_CTOUT_7                           (1 << 0)
#define P6_12_EMC_DQMOUT0                       (3 << 0)

//P7_0
#define P7_0_GPIO3_8                            (0 << 0)
#define P7_0_CTOUT_14                           (1 << 0)
#define P7_0_LCD_LE                             (3 << 0)

//P7_1
#define P7_1_GPIO3_9                            (0 << 0)
#define P7_1_CTOUT_15                           (1 << 0)
#define P7_1_I2S0_TX_WS                         (2 << 0)
#define P7_1_LCD_VD19                           (3 << 0)
#define P7_1_LCD_VD7                            (4 << 0)
#define P7_1_U2_TXD                             (6 << 0)

//P7_2
#define P7_2_GPIO3_10                           (0 << 0)
#define P7_2_CTIN_4                             (1 << 0)
#define P7_2_I2S0_TX_SDA                        (2 << 0)
#define P7_2_LCD_VD18                           (3 << 0)
#define P7_2_LCD_VD6                            (4 << 0)
#define P7_2_U2_RXD                             (6 << 0)

//P7_3
#define P7_3_GPIO3_11                           (0 << 0)
#define P7_3_CTIN_3                             (1 << 0)
#define P7_3_LCD_VD17                           (3 << 0)
#define P7_3_LCD_VD5                            (4 << 0)

//P7_4
#define P7_4_GPIO3_12                           (0 << 0)
#define P7_4_CTOUT_13                           (1 << 0)
#define P7_4_LCD_VD16                           (3 << 0)
#define P7_4_LCD_VD4                            (4 << 0)
#define P7_4_TRACEDATA_0                        (5 << 0)

//P7_5
#define P7_5_GPIO3_13                           (0 << 0)
#define P7_5_CTOUT_12                           (1 << 0)
#define P7_5_LCD_VD8                            (3 << 0)
#define P7_5_LCD_VD23                           (4 << 0)
#define P7_5_TRACEDATA_1                        (5 << 0)

//P7_6
#define P7_6_GPIO3_14                           (0 << 0)
#define P7_6_CTOUT_11                           (1 << 0)
#define P7_6_LCD_LP                             (3 << 0)
#define P7_6_TRACEDATA_2                        (5 << 0)

//P7_7
#define P7_7_GPIO3_15                           (0 << 0)
#define P7_7_CTOUT_8                            (1 << 0)
#define P7_7_LCD_PWR                            (3 << 0)
#define P7_7_TRACEDATA_3                        (5 << 0)
#define P7_7_ENET_MDC                           (6 << 0)

//P8_0
#define P8_0_GPIO4_0                            (0 << 0)
#define P8_0_USB0_PWR_FAULT                     (1 << 0)
#define P8_0_MCI2                               (3 << 0)
#define P8_0_T0_MAT0                            (7 << 0)

//P8_1
#define P8_1_GPIO4_1                            (0 << 0)
#define P8_1_USB0_IND1                          (1 << 0)
#define P8_1_MCI1                               (3 << 0)
#define P8_1_T0_MAT1                            (7 << 0)

//P8_2
#define P8_2_GPIO4_2                            (0 << 0)
#define P8_2_USB0_IND0                          (1 << 0)
#define P8_2_MCI0                               (3 << 0)
#define P8_2_T0_MAT2                            (7 << 0)

//P8_3
#define P8_3_GPIO4_3                            (0 << 0)
#define P8_3_USB1_ULPI_D2                       (1 << 0)
#define P8_3_LCD_VD12                           (3 << 0)
#define P8_3_LCD_VD19                           (4 << 0)
#define P8_3_T0_MAT3                            (7 << 0)

//P8_4
#define P8_4_GPIO4_4                            (0 << 0)
#define P8_4_USB1_ULPI_D1                       (1 << 0)
#define P8_4_LCD_VD7                            (3 << 0)
#define P8_4_LCD_VD16                           (4 << 0)
#define P8_4_T0_CAP0                            (7 << 0)

//P8_5
#define P8_5_GPIO4_5                            (0 << 0)
#define P8_5_USB1_ULPI_D0                       (1 << 0)
#define P8_5_LCD_VD6                            (3 << 0)
#define P8_5_LCD_VD8                            (4 << 0)
#define P8_5_T0_CAP1                            (7 << 0)

//P8_6
#define P8_6_GPIO4_6                            (0 << 0)
#define P8_6_USB1_ULPI_NXT                      (1 << 0)
#define P8_6_LCD_VD5                            (3 << 0)
#define P8_6_LCD_LP                             (4 << 0)
#define P8_6_T0_CAP2                            (7 << 0)

//P8_7
#define P8_7_GPIO4_7                            (0 << 0)
#define P8_7_USB1_ULPI_STP                      (1 << 0)
#define P8_7_LCD_VD4                            (3 << 0)
#define P8_7_LCD_PWR                            (4 << 0)
#define P8_7_T0_CAP3                            (7 << 0)

//P8_8
#define P8_8_USB1_ULPI_CLK                      (1 << 0)
#define P8_8_CGU_OUT0                           (6 << 0)
#define P8_8_I2S1_TX_MCLK                       (7 << 0)

//P9_0
#define P9_0_GPIO4_12                           (0 << 0)
#define P9_0_MCABORT                            (1 << 0)
#define P9_0_ENET_CRS                           (5 << 0)
#define P9_0_SSP0_SSEL                          (7 << 0)

//P9_1
#define P9_1_GPIO4_13                           (0 << 0)
#define P9_1_MCOA2                              (1 << 0)
#define P9_1_I2S0_TX_WS                         (4 << 0)
#define P9_1_ENET_RX_ER                         (5 << 0)
#define P9_1_SSP0_MISO                          (7 << 0)

//P9_2
#define P9_2_GPIO4_14                           (0 << 0)
#define P9_2_MCOB2                              (1 << 0)
#define P9_2_I2S0_TX_SDA                        (4 << 0)
#define P9_2_ENET_RXD3                          (5 << 0)
#define P9_2_SSP0_MOSI                          (7 << 0)

//P9_3
#define P9_3_GPIO4_15                           (0 << 0)
#define P9_3_MCOA0                              (1 << 0)
#define P9_3_USB1_IND1                          (2 << 0)
#define P9_3_ENET_RXD2                          (5 << 0)
#define P9_3_U3_TXD                             (7 << 0)

//P9_4
#define P9_4_MCOB0                              (1 << 0)
#define P9_4_USB1_IND0                          (2 << 0)
#define P9_4_GPIO5_17                           (4 << 0)
#define P9_4_ENET_TXD2                          (5 << 0)
#define P9_4_U3_RXD                             (7 << 0)

