alexeyk13/rexos/userspace/lpc/lpc18xx_bits.h
//P9_5
#define P9_5_MCOA1                              (1 << 0)
#define P9_5_USB1_VBUS_EN                       (2 << 0)
#define P9_5_GPIO5_18                           (4 << 0)
#define P9_5_ENET_TXD3                          (5 << 0)
#define P9_5_U0_TXD                             (7 << 0)

//P9_6
#define P9_6_GPIO4_11                           (0 << 0)
#define P9_6_MCOB1                              (1 << 0)
#define P9_6_USB1_PWR_FAULT                     (2 << 0)
#define P9_6_ENET_COL                           (5 << 0)
#define P9_6_U0_RXD                             (7 << 0)

//PA_0
#define PA_0_I2S1_RX_MCLK                       (5 << 0)
#define PA_0_CGU_OUT1                           (6 << 0)

//PA_1
#define PA_1_GPIO4_8                            (0 << 0)
#define PA_1_QEI_IDX                            (1 << 0)
#define PA_1_U2_TXD                             (3 << 0)

//PA_2
#define PA_2_GPIO4_9                            (0 << 0)
#define PA_2_QEI_PHB                            (1 << 0)
#define PA_2_U2_RXD                             (3 << 0)

//PA_3
#define PA_3_GPIO4_10                           (0 << 0)
#define PA_3_QEI_PHA                            (1 << 0)

//PA_4
#define PA_4_CTOUT_9                            (1 << 0)
#define PA_4_EMC_A23                            (3 << 0)
#define PA_4_GPIO5_19                           (4 << 0)

//PB_0
#define PB_0_CTOUT_10                           (1 << 0)
#define PB_0_LCD_VD23                           (2 << 0)
#define PB_0_GPIO5_20                           (4 << 0)

//PB_1
#define PB_1_USB1_ULPI_DIR                      (1 << 0)
#define PB_1_LCD_VD22                           (2 << 0)
#define PB_1_GPIO5_21                           (4 << 0)
#define PB_1_CTOUT_6                            (5 << 0)

//PB_2
#define PB_2_USB1_ULPI_D7                       (1 << 0)
#define PB_2_LCD_VD21                           (2 << 0)
#define PB_2_GPIO5_22                           (4 << 0)
#define PB_2_CTOUT_7                            (5 << 0)

//PB_3
#define PB_3_USB1_ULPI_D6                       (1 << 0)
#define PB_3_LCD_VD20                           (2 << 0)
#define PB_3_GPIO5_23                           (4 << 0)
#define PB_3_CTOUT_8                            (5 << 0)

//PB_4
#define PB_4_USB1_ULPI_D5                       (1 << 0)
#define PB_4_LCD_VD15                           (2 << 0)
#define PB_4_GPIO5_24                           (4 << 0)
#define PB_4_CTIN_5                             (5 << 0)

//PB_5
#define PB_5_USB1_ULPI_D4                       (1 << 0)
#define PB_5_LCD_VD14                           (2 << 0)
#define PB_5_GPIO5_25                           (4 << 0)
#define PB_5_CTIN_7                             (5 << 0)
#define PB_5_LCD_PWR                            (6 << 0)

//PB_6
#define PB_6_USB1_ULPI_D3                       (1 << 0)
#define PB_6_LCD_VD13                           (2 << 0)
#define PB_6_GPIO5_26                           (4 << 0)
#define PB_6_CTIN_6                             (5 << 0)
#define PB_6_LCD_VD19                           (6 << 0)

//PC_0
#define PC_0_USB1_ULPI_CLK                      (1 << 0)
#define PC_0_ENET_RX_CLK LCD_DCLK               (3 << 0)
#define PC_0_SD_CLK                             (6 << 0)

//PC_1
#define PC_1_USB1_ULPI_D7                       (0 << 0)
#define PC_1_U1_RI                              (2 << 0)
#define PC_1_ENET_MDC                           (3 << 0)
#define PC_1_GPIO6_0                            (4 << 0)
#define PC_1_T3_CAP0                            (6 << 0)
#define PC_1_SD_VOLT0                           (7 << 0)

//PC_2
#define PC_2_USB1_ULPI_D6                       (0 << 0)
#define PC_2_U1_CTS                             (2 << 0)
#define PC_2_ENET_TXD2                          (3 << 0)
#define PC_2_GPIO6_1                            (4 << 0)
#define PC_2_SD_RST                             (7 << 0)

//PC_3
#define PC_3_USB1_ULPI_D5                       (0 << 0)
#define PC_3_U1_RTS                             (2 << 0)
#define PC_3_ENET_TXD3                          (3 << 0)
#define PC_3_GPIO6_2                            (4 << 0)
#define PC_3_SD_VOLT1                           (7 << 0)

//PC_4
#define PC_4_USB1_ULPI_D4                       (1 << 0)
#define PC_4_ENET_TX_EN                         (3 << 0)
#define PC_4_GPIO6_3                            (4 << 0)
#define PC_4_T3_CAP1                            (6 << 0)
#define PC_4_SD_DAT0                            (7 << 0)

//PC_5
#define PC_5_USB1_ULPI_D3                       (1 << 0)
#define PC_5_ENET_TX_ER                         (3 << 0)
#define PC_5_GPIO6_4                            (4 << 0)
#define PC_5_T3_CAP2                            (6 << 0)
#define PC_5_SD_DAT1                            (7 << 0)

//PC_6
#define PC_6_USB1_ULPI_D2                       (1 << 0)
#define PC_6_ENET_RXD2                          (3 << 0)
#define PC_6_GPIO6_5                            (4 << 0)
#define PC_6_T3_CAP3                            (6 << 0)
#define PC_6_SD_DAT2                            (7 << 0)

//PC_7
#define PC_7_USB1_ULPI_D1                       (1 << 0)
#define PC_7_ENET_RXD3                          (3 << 0)
#define PC_7_GPIO6_6                            (4 << 0)
#define PC_7_T3_MAT0                            (6 << 0)
#define PC_7_SD_DAT3                            (7 << 0)

//PC_8
#define PC_8_USB1_ULPI_D0                       (1 << 0)
#define PC_8_ENET_RX_DV                         (3 << 0)
#define PC_8_GPIO6_7                            (4 << 0)
#define PC_8_T3_MAT1                            (6 << 0)
#define PC_8_SD_CD                              (7 << 0)

//PC_9
#define PC_9_USB1_ULPI_NXT                      (1 << 0)
#define PC_9_ENET_RX_ER                         (3 << 0)
#define PC_9_GPIO6_8                            (4 << 0)
#define PC_9_T3_MAT2                            (6 << 0)
#define PC_9_SD_POW                             (7 << 0)

//PC_10
#define PC_10_USB1_ULPI_STP                     (1 << 0)
#define PC_10_U1_DSR                            (2 << 0)
#define PC_10_GPIO6_9                           (4 << 0)
#define PC_10_T3_MAT3                           (6 << 0)
#define PC_10_SD_CMD                            (7 << 0)

//PC_11
#define PC_11_USB1_ULPI_DIR                     (1 << 0)
#define PC_11_U1_DCD                            (2 << 0)
#define PC_11_GPIO6_10                          (4 << 0)
#define PC_11_SD_DAT4                           (7 << 0)

//PC_12
#define PC_12_U1_DTR                            (2 << 0)
#define PC_12_GPIO6_11                          (4 << 0)
#define PC_12_I2S0_TX_SDA                       (6 << 0)
#define PC_12_SD_DAT5                           (7 << 0)

//PC_13
#define PC_13_U1_TXD                            (2 << 0)
#define PC_13_GPIO6_12                          (4 << 0)
#define PC_13_I2S0_TX_WS                        (6 << 0)
#define PC_13_SD_DAT6                           (7 << 0)

//PC_14
#define PC_14_U1_RXD                            (2 << 0)
#define PC_14_GPIO6_13                          (4 << 0)
#define PC_14_ENET_TX_ER                        (6 << 0)
#define PC_14_SD_DAT7                           (7 << 0)

