alexeyk13/rexos/userspace/lpc/lpc18xx_bits.h
//PD_0
#define PD_0_CTOUT_15                           (1 << 0)
#define PD_0_EMC_DQMOUT2                        (2 << 0)
#define PD_0_GPIO6_14                           (4 << 0)

//PD_1
#define PD_1_EMC_CKEOUT2                        (2 << 0)
#define PD_1_GPIO6_15                           (4 << 0)
#define PD_1_SD_POW                             (5 << 0)

//PD_2
#define PD_2_CTOUT_7                            (1 << 0)
#define PD_2_EMC_D16                            (2 << 0)
#define PD_2_GPIO6_16                           (4 << 0)

//PD_3
#define PD_3_CTOUT_6                            (1 << 0)
#define PD_3_EMC_D17                            (2 << 0)
#define PD_3_GPIO6_17                           (4 << 0)

//PD_4
#define PD_4_CTOUT_8                            (1 << 0)
#define PD_4_EMC_D18                            (2 << 0)
#define PD_4_GPIO6_18                           (4 << 0)

//PD_5
#define PD_5_CTOUT_9                            (1 << 0)
#define PD_5_EMC_D19                            (2 << 0)
#define PD_5_GPIO6_19                           (4 << 0)

//PD_6
#define PD_6_CTOUT_10                           (1 << 0)
#define PD_6_EMC_D20                            (2 << 0)
#define PD_6_GPIO6_20                           (4 << 0)

//PD_7
#define PD_7_CTIN_5                             (1 << 0)
#define PD_7_EMC_D21                            (2 << 0)
#define PD_7_GPIO6_21                           (4 << 0)

//PD_8
#define PD_8_CTIN_6                             (1 << 0)
#define PD_8_EMC_D22                            (2 << 0)
#define PD_8_GPIO6_22                           (4 << 0)

//PD_9
#define PD_9_CTOUT_13                           (1 << 0)
#define PD_9_EMC_D23                            (2 << 0)
#define PD_9_GPIO6_23                           (4 << 0)

//PD_10
#define PD_10_CTIN_1                            (1 << 0)
#define PD_10_EMC_BLS3                          (2 << 0)
#define PD_10_GPIO6_24                          (4 << 0)

//PD_11
#define PD_11_EMC_CS3                           (2 << 0)
#define PD_11_GPIO6_25                          (4 << 0)
#define PD_11_USB1_ULPI_D0                      (5 << 0)
#define PD_11_CTOUT_14                          (6 << 0)

//PD_12
#define PD_12_EMC_CS2                           (2 << 0)
#define PD_12_GPIO6_26                          (4 << 0)
#define PD_12_CTOUT_10                          (6 << 0)

//PD_13
#define PD_13_CTIN_0                            (1 << 0)
#define PD_13_EMC_BLS2                          (2 << 0)
#define PD_13_GPIO6_27                          (4 << 0)
#define PD_13_CTOUT_13                          (6 << 0)

//PD_14
#define PD_14_EMC_DYCS2                         (2 << 0)
#define PD_14_GPIO6_28                          (4 << 0)
#define PD_14_CTOUT_11                          (6 << 0)

//PD_15
#define PD_15_EMC_A17                           (2 << 0)
#define PD_15_GPIO6_29                          (4 << 0)
#define PD_15_SD_WP                             (5 << 0)
#define PD_15_CTOUT_8                           (6 << 0)

//PD_16
#define PD_16_EMC_A16                           (2 << 0)
#define PD_16_GPIO6_30                          (4 << 0)
#define PD_16_SD_VOLT2                          (5 << 0)
#define PD_16_CTOUT_12                          (6 << 0)

//PE_0
#define PE_0_EMC_A18                            (3 << 0)
#define PE_0_GPIO7_0                            (4 << 0)
#define PE_0_CAN1_TD                            (5 << 0)

//PE_1
#define PE_1_EMC_A19                            (3 << 0)
#define PE_1_GPIO7_1                            (4 << 0)
#define PE_1_CAN1_RD                            (5 << 0)

//PE_2
#define PE_2_ADCTRIG0                           (0 << 0)
#define PE_2_CAN0_RD                            (1 << 0)
#define PE_2_EMC_A20                            (3 << 0)
#define PE_2_GPIO7_2                            (4 << 0)

//PE_3
#define PE_3_CAN0_TD                            (1 << 0)
#define PE_3_ADCTRIG1                           (2 << 0)
#define PE_3_EMC_A21                            (3 << 0)
#define PE_3_GPIO7_3                            (4 << 0)

//PE_4
#define PE_4_NMI                                (1 << 0)
#define PE_4_EMC_A22                            (3 << 0)
#define PE_4_GPIO7_4                            (4 << 0)

//PE_5
#define PE_5_CTOUT_3                            (1 << 0)
#define PE_5_U1_RTS                             (2 << 0)
#define PE_5_EMC_D24                            (3 << 0)
#define PE_5_GPIO7_5                            (4 << 0)

//PE_6
#define PE_6_CTOUT_2                            (1 << 0)
#define PE_6_U1_RI                              (2 << 0)
#define PE_6_EMC_D25                            (3 << 0)
#define PE_6_GPIO7_6                            (4 << 0)

//PE_7
#define PE_7_CTOUT_5                            (1 << 0)
#define PE_7_U1_CTS                             (2 << 0)
#define PE_7_EMC_D26                            (3 << 0)
#define PE_7_GPIO7_7                            (4 << 0)

//PE_8
#define PE_8_CTOUT_4                            (1 << 0)
#define PE_8_U1_DSR                             (2 << 0)
#define PE_8_EMC_D27                            (3 << 0)
#define PE_8_GPIO7_8                            (4 << 0)

//PE_9
#define PE_9_CTIN_4                             (1 << 0)
#define PE_9_U1_DCD                             (2 << 0)
#define PE_9_EMC_D28                            (3 << 0)
#define PE_9_GPIO7_9                            (4 << 0)

//PE_10
#define PE_10_CTIN_3                            (1 << 0)
#define PE_10_U1_DTR                            (2 << 0)
#define PE_10_EMC_D29                           (3 << 0)
#define PE_10_GPIO7_10                          (4 << 0)

//PE_11
#define PE_11_CTOUT_12                          (1 << 0)
#define PE_11_U1_TXD                            (2 << 0)
#define PE_11_EMC_D30                           (3 << 0)
#define PE_11_GPIO7_11                          (4 << 0)

//PE_12
#define PE_12_CTOUT_11                          (1 << 0)
#define PE_12_U1_RXD                            (2 << 0)
#define PE_12_EMC_D31                           (3 << 0)
#define PE_12_GPIO7_12                          (4 << 0)

//PE_13
#define PE_13_CTOUT_14                          (1 << 0)
#define PE_13_I2C1_SDA                          (2 << 0)
#define PE_13_EMC_DQMOUT                        (3 << 0)
#define PE_13_GPIO7_13                          (4 << 0)

//PE_14
#define PE_14_EMC_DYCS3                         (3 << 0)
#define PE_14_GPIO7_14                          (4 << 0)

