alexeyk13/rexos/userspace/lpc/lpc18xx_bits.h
//PE_15
#define PE_15_CTOUT_0                           (1 << 0)
#define PE_15_I2C1_SCL                          (2 << 0)
#define PE_15_EMC_CKEOUT                        (3 << 0)
#define PE_15_GPIO7_15                          (4 << 0)

//PF_0
#define PF_0_SSP0_SCK                           (0 << 0)
#define PF_0_GP_CLKIN                           (1 << 0)
#define PF_0_I2S1_TX_MCLK                       (7 << 0)

//PF_1
#define PF_1_SSP0_SSEL                          (2 << 0)
#define PF_1_GPIO7_16                           (4 << 0)

//PF_2
#define PF_2_U3_TXD                             (1 << 0)
#define PF_2_SSP0_MISO                          (2 << 0)
#define PF_2_GPIO7_17                           (4 << 0)

//PF_3
#define PF_3_U3_RXD                             (1 << 0)
#define PF_3_SSP0_MOSI                          (2 << 0)
#define PF_3_GPIO7_18                           (4 << 0)

//PF_4
#define PF_4_SSP1_SCK                           (0 << 0)
#define PF_4_GP_CLKIN                           (1 << 0)
#define PF_4_TRACECLK                           (2 << 0)
#define PF_4_I2S0_TX_MCLK                       (6 << 0)
#define PF_4_I2S0_RX_SCK                        (7 << 0)

//PF_5
#define PF_5_U3_UCLK                            (1 << 0)
#define PF_5_SSP1_SSEL                          (2 << 0)
#define PF_5_TRACEDATA_0                        (3 << 0)
#define PF_5_GPIO7_19                           (4 << 0)

//PF_6
#define PF_6_U3_DIR                             (1 << 0)
#define PF_6_SSP1_MISO                          (2 << 0)
#define PF_6_TRACEDATA_1                        (3 << 0)
#define PF_6_GPIO7_20                           (4 << 0)
#define PF_6_I2S1_TX_SDA                        (7 << 0)

//PF_7
#define PF_7_U3_BAUD                            (1 << 0)
#define PF_7_SSP1_MOSI                          (2 << 0)
#define PF_7_TRACEDATA_2                        (3 << 0)
#define PF_7_GPIO7_21                           (4 << 0)
#define PF_7_I2S1_TX_WS                         (7 << 0)

//PF_8
#define PF_8_U0_UCLK                            (1 << 0)
#define PF_8_CTIN_2                             (2 << 0)
#define PF_8_TRACEDATA_3                        (3 << 0)
#define PF_8_GPIO7_22                           (4 << 0)

//PF_9
#define PF_9_U0_DIR                             (1 << 0)
#define PF_9_CTOUT_1                            (2 << 0)
#define PF_9_GPIO7_23                           (4 << 0)

//PF_10
#define PF_10_U0_TXD                            (1 << 0)
#define PF_10_GPIO7_24                          (4 << 0)
#define PF_10_SD_WP                             (6 << 0)

//PF_11
#define PF_11_U0_RXD                            (1 << 0)
#define PF_11_GPIO7_25                          (4 << 0)
#define PF_11_SD_VOLT2                          (6 << 0)

//CLK_0
#define CLK_0_EMC_CLK0                          (0 << 0)
#define CLK_0_CLKOUT                            (1 << 0)
#define CLK_0_SD_CLK                            (4 << 0)
#define CLK_0_EMC_CLK01                         (5 << 0)
#define CLK_0_SSP1_SCK                          (6 << 0)
#define CLK_0_ENET_TX_CLK                       (7 << 0)
#define CLK_0_ENET_REF_CLK                      (7 << 0)

//CLK_1
#define CLK_1_EMC_CLK1                          (0 << 0)
#define CLK_1_CLKOUT                            (1 << 0)
#define CLK_1_CGU_OUT0                          (5 << 0)
#define CLK_1_I2S1_TX_MCLK                      (7 << 0)

//CLK_2
#define CLK_2_EMC_CLK3                          (0 << 0)
#define CLK_2_CLKOUT                            (1 << 0)
#define CLK_2_SD_CLK                            (4 << 0)
#define CLK_2_EMC_CLK23                         (5 << 0)
#define CLK_2_I2S0_TX_MCLK                      (6 << 0)
#define CLK_2_I2S1_RX_SCK                       (7 << 0)

//CLK_3
#define CLK_3_EMC_CLK2                          (0 << 0)
#define CLK_3_CLKOUT                            (1 << 0)
#define CLK_3_CGU_OUT1                          (5 << 0)
#define CLK_3_I2S1_RX_SCK                       (7 << 0)


/******************************************************************************/
/*                                                                            */
/*                            USART                                           */
/*                                                                            */
/******************************************************************************/

/**********  Bit definition for LCR register  *********************************/
#define USART0_LCR_WLS_5                        (0 << 0)
#define USART0_LCR_WLS_6                        (1 << 0)
#define USART0_LCR_WLS_7                        (2 << 0)
#define USART0_LCR_WLS_8                        (3 << 0)

#define USART0_LCR_SBS_1                        (0 << 2)
#define USART0_LCR_SBS_2                        (1 << 2)

#define USART0_LCR_PS_ODD                       (0 << 4)
#define USART0_LCR_PS_EVEN                      (1 << 4)
#define USART0_LCR_PS_FORCE_1                   (2 << 4)
#define USART0_LCR_PS_FORCE_0                   (3 << 4)

/**********  Bit definition for IIR register  *********************************/
#define USART0_IIR_INTID_MODEM_STATUS           (0 << 1)
#define USART0_IIR_INTID_THRE                   (1 << 1)
#define USART0_IIR_INTID_RDA                    (2 << 1)
#define USART0_IIR_INTID_RLS                    (3 << 1)
#define USART0_IIR_INTID_CTI                    (6 << 1)

/******************************************************************************/
/*                                                                            */
/*                               USB0                                         */
/*                                                                            */
/******************************************************************************/

/******  Bit definition for USB0_USBSTS_D register  ***************************/
#define USB0_USBSTS_D_SEI_Msk                   (1 << 4)                        //forgotten in vendor shipped LPC18xx.h

/*****  Bit definition for USB0_USBINTR_D register  ***************************/
#define USB0_USBINTR_D_SEE_Msk                  (1 << 4)                        //forgotten in vendor shipped LPC18xx.h

